Wang/nn_chemistry/1D_detonation_AR_H2_O2/constant/chemFFCM1final
species
10
(
H
H2
O
O2
OH
H2O
HO2
H2O2
O3
AR
)
;

reactions
{
    ffcm1-reaction-0
        {
            type            reversibleArrheniusReaction;
            reaction        "H + O2 = O + OH";
            A               9.841e+10;
            beta            0;
            Ta              7704.29;
        }
    ffcm1-reaction-1
        {
            type            reversibleArrheniusReaction;
            reaction        "H2 + O = H + OH";
            A               3.848e+09;
            beta            0;
            Ta              4000.6;
        }
    ffcm1-reaction-2
        {
            type            reversibleArrheniusReaction;
            reaction        "H2 + O = H + OH";
            A               6.687e+11;
            beta            0;
            Ta              9651.75;
        }
    ffcm1-reaction-3
        {
            type            reversibleArrheniusReaction;
            reaction        "H2 + OH = H + H2O";
            A               2.256e+05;
            beta            1.51;
            Ta              1729.57;
        }
    ffcm1-reaction-4
        {
            type            reversibleArrheniusReaction;
            reaction        "2 OH = H2O + O";
            A               31.61;
            beta            2.42;
            Ta              -970.207;
        }
    ffcm1-reaction-5
        {
            type            reversiblethirdBodyArrheniusReaction;
            reaction        "H2  = 2 H ";
            A               4.58e+16;
            beta            -1.4;
            Ta              52531.1;
        coeffs          
10
(
(H 1.0)
(H2 2.55)
(O 1.0)
(O2 1.0)
(OH 1.0)
(H2O 12.02)
(HO2 1.0)
(H2O2 1.0)
(O3 1.0)
(AR 0.0)
)
;
        }
    ffcm1-reaction-6
        {
            type            reversibleArrheniusReaction;
            reaction        "H2 + AR = 2 H + AR";
            A               5.176e+15;
            beta            -1.1;
            Ta              52531.1;
        }
    ffcm1-reaction-7
        {
            type            reversiblethirdBodyArrheniusReaction;
            reaction        "2 O  = O2 ";
            A               6.16e+09;
            beta            -0.5;
            Ta              0;
        coeffs          
10
(
(H 1.0)
(H2 2.5)
(O 1.0)
(O2 1.0)
(OH 1.0)
(H2O 12.0)
(HO2 1.0)
(H2O2 1.0)
(O3 1.0)
(AR 0.0)
)
;
        }
    ffcm1-reaction-8
        {
            type            reversibleArrheniusReaction;
            reaction        "2 O + AR = O2 + AR";
            A               1.89e+07;
            beta            0;
            Ta              -899.757;
        }
    ffcm1-reaction-9
        {
            type            reversiblethirdBodyArrheniusReaction;
            reaction        "H + O  = OH ";
            A               4.71e+12;
            beta            -1;
            Ta              0;
        coeffs          
10
(
(H 1.0)
(H2 2.5)
(O 1.0)
(O2 1.0)
(OH 1.0)
(H2O 15.8)
(HO2 1.0)
(H2O2 1.0)
(O3 1.0)
(AR 0.75)
)
;
        }
    ffcm1-reaction-10
        {
            type            reversiblethirdBodyArrheniusReaction;
            reaction        "H2O  = H + OH ";
            A               6.06e+24;
            beta            -3.32;
            Ta              60788.9;
        coeffs          
10
(
(H 1.0)
(H2 3.77)
(O 1.0)
(O2 1.5)
(OH 1.0)
(H2O 0.0)
(HO2 1.0)
(H2O2 1.0)
(O3 1.0)
(AR 1.23)
)
;
        }
    ffcm1-reaction-11
        {
            type            reversibleArrheniusReaction;
            reaction        "H2O + H2O = H + OH + H2O";
            A               7.528e+22;
            beta            -2.44;
            Ta              60487;
        }
    ffcm1-reaction-12
        {
            type            reversibleArrheniusTroeFallOffReaction;
            reaction        "H + O2  = HO2 ";
            k0
        {
            A               6.37e+14;
            beta            -1.72;
            Ta              264.19;
        }
        kInf
        {
            A               4.565e+09;
            beta            0.44;
            Ta              0;
        }
        F
        {
            alpha           0.5;
            Tsss            30;
            Ts              90000;
            Tss             90000;
        }
        thirdBodyEfficiencies
        {
            coeffs          
10
(
(H 1.0)
(H2 1.87)
(O 1.0)
(O2 0.75)
(OH 1.0)
(H2O 15.81)
(HO2 1.0)
(H2O2 1.0)
(O3 1.0)
(AR 0.6)
)
;
        }
        }
    ffcm1-reaction-13
        {
            type            reversibleArrheniusReaction;
            reaction        "H + HO2 = H2 + O2";
            A               2945;
            beta            2.09;
            Ta              -732.184;
        }
    ffcm1-reaction-14
        {
            type            reversibleArrheniusReaction;
            reaction        "H + HO2 = 2 OH";
            A               5.888e+10;
            beta            0;
            Ta              150.966;
        }
    ffcm1-reaction-15
        {
            type            reversibleArrheniusReaction;
            reaction        "H + HO2 = H2O + O";
            A               1.632e+09;
            beta            0;
            Ta              0;
        }
    ffcm1-reaction-16
        {
            type            reversibleArrheniusReaction;
            reaction        "HO2 + O = O2 + OH";
            A               1.609e+10;
            beta            0;
            Ta              -223.933;
        }
    ffcm1-reaction-17
        {
            type            reversibleArrheniusReaction;
            reaction        "HO2 + OH = H2O + O2";
            A               7.347e+09;
            beta            0;
            Ta              -550.019;
        }
    ffcm1-reaction-18
        {
            type            reversibleArrheniusReaction;
            reaction        "HO2 + OH = H2O + O2";
            A               4.534e+11;
            beta            0;
            Ta              5500.19;
        }
    ffcm1-reaction-19
        {
            type            reversibleArrheniusReaction;
            reaction        "2 HO2 = H2O2 + O2";
            A               1.958e+08;
            beta            0;
            Ta              -709.036;
        }
    ffcm1-reaction-20
        {
            type            reversibleArrheniusReaction;
            reaction        "2 HO2 = H2O2 + O2";
            A               1.111e+11;
            beta            0;
            Ta              5555.54;
        }
    ffcm1-reaction-21
        {
            type            reversibleArrheniusTroeFallOffReaction;
            reaction        "H2O2  = 2 OH ";
            k0
        {
            A               2.49e+21;
            beta            -2.3;
            Ta              24532;
        }
        kInf
        {
            A               2.187e+12;
            beta            0.9;
            Ta              24532;
        }
        F
        {
            alpha           0.58;
            Tsss            30;
            Ts              90000;
            Tss             90000;
        }
        thirdBodyEfficiencies
        {
            coeffs          
10
(
(H 1.0)
(H2 3.27)
(O 1.0)
(O2 1.2)
(OH 1.0)
(H2O 6.63)
(HO2 1.0)
(H2O2 6.61)
(O3 1.0)
(AR 0.85)
)
;
        }
        }
    ffcm1-reaction-22
        {
            type            reversibleArrheniusReaction;
            reaction        "H + H2O2 = H2O + OH";
            A               2.045e+10;
            beta            0;
            Ta              1997.78;
        }
    ffcm1-reaction-23
        {
            type            reversibleArrheniusReaction;
            reaction        "H + H2O2 = H2 + HO2";
            A               5.856e+10;
            beta            0;
            Ta              4000.6;
        }
    ffcm1-reaction-24
        {
            type            reversibleArrheniusReaction;
            reaction        "H2O2 + O = HO2 + OH";
            A               8513;
            beta            2;
            Ta              1997.78;
        }
    ffcm1-reaction-25
        {
            type            reversibleArrheniusReaction;
            reaction        "H2O2 + OH = H2O + HO2";
            A               1.565e+09;
            beta            0;
            Ta              160.024;
        }
    ffcm1-reaction-26
        {
            type            reversibleArrheniusReaction;
            reaction        "H2O2 + OH = H2O + HO2";
            A               7.34e+10;
            beta            0;
            Ta              3658.41;
        }
    ffcm1-reaction-27
        {
            type            reversibleArrheniusTroeFallOffReaction;
            reaction        "O3  = O + O2 ";
            k0
        {
            A               2.275e+25;
            beta            -4.37;
            Ta              13736.4;
        }
        kInf
        {
            A               1.37e+15;
            beta            -0.67;
            Ta              13078.7;
        }
        F
        {
            alpha           0.6417;
            Tsss            0.000391;
            Ts              8680.74;
            Tss             6060.75;
        }
        thirdBodyEfficiencies
        {
            coeffs          
10
(
(H 1.0)
(H2 3.0)
(O 6.0)
(O2 1.5)
(OH 1.0)
(H2O 1.0)
(HO2 1.0)
(H2O2 1.0)
(O3 3.75)
(AR 1.0)
)
;
        }
        }
    ffcm1-reaction-28
        {
            type            reversibleArrheniusReaction;
            reaction        "O + O3 = 2 O2";
            A               4.82e+09;
            beta            0;
            Ta              2060.18;
        }
    ffcm1-reaction-29
        {
            type            reversibleArrheniusReaction;
            reaction        "H + O3 = O2 + OH";
            A               8.43e+10;
            beta            0;
            Ta              470.007;
        }
    ffcm1-reaction-30
        {
            type            reversibleArrheniusReaction;
            reaction        "H + O3 = HO2 + O";
            A               4.52e+08;
            beta            0;
            Ta              0;
        }
    ffcm1-reaction-31
        {
            type            reversibleArrheniusReaction;
            reaction        "O3 + OH = HO2 + O2";
            A               1.85e+08;
            beta            0;
            Ta              418.175;
        }
    ffcm1-reaction-32
        {
            type            reversibleArrheniusReaction;
            reaction        "H2O + O3 = H2O2 + O2";
            A               0.0662;
            beta            0;
            Ta              0;
        }
    ffcm1-reaction-33
        {
            type            reversibleArrheniusReaction;
            reaction        "HO2 + O3 = 2 O2 + OH";
            A               6.62e+06;
            beta            0;
            Ta              500.2;
        }
}
