Wang/nn_chemistry/1D_detonation_AR_H2_O2/constant/thermFFCM1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermo.compressibleGas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

H
{
    specie
    {
        nMoles          1;
        molWeight       1.00797;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           3500;
        Tcommon         1000;
        highCpCoeffs    (2.50000001 -2.30842973e-11 1.61561948e-14 -4.73515235e-18 4.98197357e-22 25471.6 -0.460118);
        lowCpCoeffs     (2.50000000  7.05332819e-13 -1.99591964e-15  2.30081632e-18 -9.27732332e-22 25471.6 -0.460118);
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

H2
{
    specie
    {
        nMoles          1;
        molWeight       2.01594;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           3500;
        Tcommon         1000;
        highCpCoeffs    (3.33727920 -4.94024731e-05 4.99456778e-07 -1.79566394e-10 2.00255376e-14 -950.158922 -3.20502331);
        lowCpCoeffs     (2.34433112 7.98052075e-03 -1.94781510e-05  2.01572094e-08 -7.37611761e-12 -917.935173 6.83010238);
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

O
{
    specie
    {
        nMoles          1;
        molWeight       15.9994;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           3500;
        Tcommon         1000;
        highCpCoeffs    (2.56942078 -8.59741137e-05 4.19484589e-08 -1.00177799e-11 1.22833691e-15 29217.5791 4.78433864);
        lowCpCoeffs     (3.16826710 -3.27931884e-03 6.64306396e-06 -6.12806624e-09 2.11265971e-12 29122.2592 2.05193346);
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

O2
{
    specie
    {
        nMoles          1;
        molWeight       31.9988;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           3500;
        Tcommon         1000;
        highCpCoeffs    (3.28253784 1.48308754e-03 -7.57966669e-07 2.09470555e-10 -2.16717794e-14 -1088.45772 5.45323129);
        lowCpCoeffs     (3.78245636 -2.99673416e-03 9.84730201e-06 -9.68129509e-09 3.24372837e-12 -1063.94356 3.65767573);
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

OH
{
    specie
    {
        nMoles          1;
        molWeight       17.0074;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    (2.86472886 1.05650448e-03 -2.59082758e-07 3.05218674e-11 -1.33195876e-15 3718.85774 5.70164073);
        lowCpCoeffs     (4.12530561 -3.22544939e-03 6.52764691e-06 -5.79853643e-09 2.06237379e-12 3381.53812 -0.690433);
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

H2O
{
    specie
    {
        molWeight       18.0153;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 2.67215 0.00305629 -8.73026e-07 1.201e-10 -6.39162e-15 -29899.2 6.86282 );
        lowCpCoeffs     ( 3.38684 0.00347498 -6.3547e-06 6.96858e-09 -2.50659e-12 -30208.1 2.59023 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

AR
{
    specie
    {
        nMoles          1;
        molWeight       39.948;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    (2.50000000 0.00000000 0.00000000 0.00000000 0.00000000 -745.375 4.366);
        lowCpCoeffs     (2.50000000 0.00000000 0.00000000 0.00000000 0.00000000 -745.375 4.366);
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

O3
{
    specie
    {
        nMoles          1;
        molWeight       48.0;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    (12.3302914  -0.0119324783 7.98741278e-06 -1.77194552e-09 1.26075824e-13 1.26755831e+04 -40.8823374);
        lowCpCoeffs     (3.40738221 2.05379063e-03 1.38486052e-05 -2.23311542e-08 9.76073226e-12 1.58644979e+04 8.2824758);
    }
    transport
    {
        As              1.67212e-06;
        Ts              180.0;
    }
}
H2O2
{
    specie
    {
        nMoles          1;
        molWeight       34.0147;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 4.57317 0.00433614 -1.47469e-06 2.3489e-10 -1.43165e-14 -18007 0.501137 );
        lowCpCoeffs     ( 3.38875 0.00656923 -1.48501e-07 -4.62581e-09 2.47151e-12 -17663.1 6.78536 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}
HO2
{
    specie
    {
        nMoles          1;
        molWeight       33.0068;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 4.01721 0.00223982 -6.33658e-07 1.14246e-10 -1.07909e-14 111.857 3.7851 );
        lowCpCoeffs     ( 4.3018 -0.00474912 2.11583e-05 -2.42764e-08 9.29225e-12 294.808 3.71666 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}
