Wang/nn_chemistry/1D_detonation_AR_H2_O2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "libchemistryModel_DLB.so" 
);

application     detonationNSFoam_Sutherland;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime       2.5e-4;	

deltaT          1e-8;

writeControl    adjustableRunTime;

writeInterval	1e-5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   12;

runTimeModifiable true;

adjustTimeStep  yes;

useAcousticCourant yes;

maxCo           0.2;
maxDeltaT		1e-6;
maxAcousticCo	0.2;

functions
{
    lineSampler
    {
        type            sets;
        functionObjectLibs ("libsampling.so");  // Make sure this library is available
        outputControl   writeTime;               // Or "runTime" or "writeTime"
        outputInterval  1;                      // Adjust this to your needs (e.g., every timestep)

        interpolationScheme cellPoint;

        setFormat raw;                         // Change to vtk, ensight, etc., if needed

        fields
        (
            p
            U
            T
            H2
            OH
            H2O
            O2
            H2O2
            Qdot
        );

        sets
        (
            lineSample
            {
                type        lineUniform;          // Uniformly spaced points along a line
                axis        x;                // Sampling along x-axis
                start       (0.0 0 0);        // Start point
                end         (0.5 0 0);        // End point
                nPoints     2000;             // Number of points along the line
            }
        );
    }
}

// ************************************************************************* //
