Wang/nn_chemistry/1D_detonation_AR_H2_O2/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme		HLLCP;

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
	default         Gauss linear;
}

divSchemes
{
       	default        Gauss linear;
	div(tauMC)     Gauss linear;
        div(phi,Yi_h)  Gauss vanLeer;
}

laplacianSchemes
{
		default			Gauss linear uncorrected;	
}

interpolationSchemes
{
    default             linear;
    reconstruct(rho)    Minmod;
    reconstruct(U)      MinmodV;
    reconstruct(e)      Minmod;
    reconstruct(p)      Minmod;
    reconstruct(c)      Minmod;
    reconstruct(Y)      Minmod;
    reconstruct(T)      Minmod;
}  

snGradSchemes
{
		default				uncorrected;
}


// ************************************************************************* //
