Wang/nn_chemistry/1D_detonation_AR_H2_O2/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}

// Interpolation scheme: cell, cellPoint, point, face
interpolationScheme cellPoint;

// Fields to sample
fields
(
    p
    U
    T
    H2
    OH
    H2O
    O2
    H2O2
    Qdot
);

// Sampling method: use line
sets
(
    lineSample
    {
        type        uniform;  // Uniformly spaced points along a line
        axis        x;        // Sampling along x-axis
        start       (0.0 0 0);  // Start point
        end         (0.5 0 0);  // End point
        nPoints     2000;      // Number of points along the line
    }
);

// Output format (options: raw, vtk, ensight, xmgr)
setFormat raw;

